# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:

* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM ERD

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [28]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')

In [29]:
# Looking into what is included in the database
pd.read_sql("""
SELECT *
  FROM sqlite_schema;
  """,conn)

,type,name,tbl_name,rootpage,sql
0,table,productlines,productlines,46,"CREATE TABLE `productlines` (`productLine`, `t..."
1,table,offices,offices,32,"CREATE TABLE ""offices"" (\n\t""officeCode""\tINTE..."
2,table,customers,customers,57,"CREATE TABLE ""customers"" (\n\t""customerNumber""..."
3,table,employees,employees,35,"CREATE TABLE ""employees"" (\n\t""employeeNumber""..."
4,table,orderdetails,orderdetails,2,"CREATE TABLE ""orderdetails"" (\n\t""orderNumber""..."
5,table,orders,orders,27,"CREATE TABLE ""orders"" (\n\t""orderNumber""\tINTE..."
6,table,payments,payments,28,"CREATE TABLE ""payments"" (\n\t""customerNumber""\..."
7,table,products,products,4,"CREATE TABLE ""products"" (\n\t""productCode""\tTE..."

## Select the names of all employees in Boston 

Hint: join the employees and offices tables. Select the first and last name.

In [30]:
pd.read_sql("""
SELECT firstName, lastName
  FROM employees AS e
  JOIN offices AS o
    on e.officeCode = o.officeCode
 WHERE city = "Boston";
  """,conn).head()

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by. Select the office code, city, and number of employees.

In [38]:
pd.read_sql("""
  SELECT COUNT(employeeNumber) as num_employees,
         city
    FROM employees AS e
    JOIN offices AS o
      ON e.officeCode = o.officeCode
GROUP BY o.officeCode
ORDER BY num_employees;
  """,conn)

   num_employees           city
0              2         Boston
1              2            NYC
2              2          Tokyo
3              2         London
4              4         Sydney
5              5          Paris
6              6  San Francisco

## Write 3 questions of your own and answer them

In [36]:
"""
What employees were the top fives sales representatives and 
how much product did they sell?
"""
pd.read_sql("""
  SELECT e.firstName, 
         e.lastName, 
         t.total_sales
  FROM employees AS e
  JOIN (SELECT SUM(amount) AS total_sales,
               salesRepEmployeeNumber
          FROM customers AS c
          JOIN payments AS p
               USING(customerNumber)
      GROUP BY salesRepEmployeeNumber
         ORDER BY total_sales DESC) AS t
    ON t.salesRepEmployeeNumber = e.employeeNumber;
  """,conn).head()

  firstName   lastName  total_sales
0    Leslie   Jennings    989906.55
1    Leslie   Thompson    347533.03
2     Julie   Firrelli    386663.20
3     Steve  Patterson    449219.13
4  Foon Yue      Tseng    488212.67

In [42]:
"""
What is the average price of a product per product line?
"""

pd.read_sql("""
  SELECT productLine,
         AVG(priceEach) AS avg_price
    FROM products AS p
    JOIN orderdetails AS o
         USING(productCode)
GROUP BY productLine
ORDER BY avg_price DESC;
  """,conn).head()

        productLine   avg_price
0      Classic Cars  108.004475
1  Trucks and Buses   92.709253
2       Motorcycles   87.322925
3            Planes   80.327202
4      Vintage Cars   78.356088

In [54]:
"""
Which product vendors take have the longest time between order and shipment?
Which have the least?"""

pd.read_sql("""
 SELECT AVG(ship_time) as avg_ship_time,
        productVendor
   FROM products as p
   JOIN (SELECT (julianday(shippedDate)-julianday(orderDate)) as ship_time,
                productCode
           FROM orders AS o1
           JOIN orderdetails as o2
                USING(orderNumber)) AS o
         USING(productCode)
GROUP BY productVendor
ORDER BY avg_ship_time DESC
   LIMIT 1;
  """,conn)

   avg_ship_time             productVendor
0       4.262673  Highway 66 Mini Classics

In [55]:
pd.read_sql("""
 SELECT AVG(ship_time) as avg_ship_time,
        productVendor
   FROM products as p
   JOIN (SELECT (julianday(shippedDate)-julianday(orderDate)) as ship_time,
                productCode
           FROM orders AS o1
           JOIN orderdetails as o2
                USING(orderNumber)) AS o
         USING(productCode)
GROUP BY productVendor
ORDER BY avg_ship_time
   LIMIT 1;
  """,conn)

   avg_ship_time            productVendor
0       3.467811  Motor City Art Classics

## Level Up 1: Display the names of every individual product that each employee has sold

Hint: You will need to use multiple `JOIN` clauses to connect all the way from employee names to product names.

In [31]:
# Here is the dataframe that techically answers the question. 
# However, I am also interested in creating a dictionary with 
# Names as keys and a list of products as values. 
# I admit this might be useless, but it'll be good practice. 
df1 = pd.read_sql("""
    SELECT e.firstName,
           e.lastName,
           p.productName
    FROM employees AS e
    LEFT JOIN customers AS c
        ON e.employeeNumber = c.salesRepEmployeeNumber
    LEFT JOIN orders AS o2
        USING(customerNumber)
    LEFT JOIN orderDetails AS o
        USING(orderNumber)
    LEFT JOIN products AS p
        USING(productCode)
    ORDER BY e.lastName, e.firstName, p.productName;
  """,conn)

In [4]:
# Let's query to get all of the unique employee's names. 
emp_uniq = pd.read_sql("""
    SELECT lastName||", "||firstName AS full_name
    FROM employees
    GROUP BY employeeNumber
    ORDER BY full_name;
  """,conn)

In [32]:
# Let's create a dictionary template to iterate through later. 
prod_dict = {}
for i in range(0,len(emp_uniq)):
    prod_dict[emp_uniq['full_name'][i]] = []

In [33]:
# Now lets populate that dictionary by iterating through the original query
for i in range(0,len(df1)):
    key = df1['lastName'][i]+", "+df1['firstName'][i]
    value = df1['productName'][i]
    prod_dict[key].append(value)

In [50]:
# Lets look a random entry in our dictionary
prod_dict['Bondur, Loui']

['18th century schooner',
 '1900s Vintage Bi-Plane',
 '1900s Vintage Tri-Plane',
 '1903 Ford Model A',
 '1903 Ford Model A',
 '1904 Buick Runabout',
 '1911 Ford Town Car',
 '1911 Ford Town Car',
 '1912 Ford Model T Delivery Wagon',
 '1917 Grand Touring Sedan',
 '1917 Grand Touring Sedan',
 '1917 Maxwell Touring Car',
 '1926 Ford Fire Engine',
 '1926 Ford Fire Engine',
 '1928 British Royal Navy Airplane',
 '1928 Ford Phaeton Deluxe',
 '1928 Mercedes-Benz SSK',
 '1928 Mercedes-Benz SSK',
 '1930 Buick Marquette Phaeton',
 '1932 Alfa Romeo 8C2300 Spider Sport',
 '1932 Alfa Romeo 8C2300 Spider Sport',
 '1932 Model A Ford J-Coupe',
 '1932 Model A Ford J-Coupe',
 '1932 Model A Ford J-Coupe',
 '1936 Harley Davidson El Knucklehead',
 '1936 Harley Davidson El Knucklehead',
 '1936 Mercedes Benz 500k Roadster',
 '1936 Mercedes-Benz 500K Special Roadster',
 '1936 Mercedes-Benz 500K Special Roadster',
 '1937 Horch 930V Limousine',
 '1937 Lincoln Berline',
 '1937 Lincoln Berline',
 '1938 Cadillac V-16 Presidential Limousine',
 '1938 Cadillac V-16 Presidential Limousine',
 '1939 Cadillac Limousine',
 '1939 Chevrolet Deluxe Coupe',
 '1939 Chevrolet Deluxe Coupe',
 '1939 Chevrolet Deluxe Coupe',
 '1940 Ford Pickup Truck',
 '1940s Ford truck',
 '1940s Ford truck',
 '1941 Chevrolet Special Deluxe Cabriolet',
 '1948 Porsche 356-A Roadster',
 '1948 Porsche Type 356 Roadster',
 '1948 Porsche Type 356 Roadster',
 '1949 Jaguar XK 120',
 "1950's Chicago Surface Lines Streetcar",
 "1950's Chicago Surface Lines Streetcar",
 '1952 Alpine Renault 1300',
 '1952 Citroen-15CV',
 '1954 Greyhound Scenicruiser',
 '1954 Greyhound Scenicruiser',
 '1956 Porsche 356A Coupe',
 '1957 Chevy Pickup',
 '1957 Corvette Convertible',
 '1957 Corvette Convertible',
 '1957 Corvette Convertible',
 '1957 Ford Thunderbird',
 '1957 Ford Thunderbird',
 '1957 Vespa GS150',
 '1957 Vespa GS150',
 '1957 Vespa GS150',
 '1957 Vespa GS150',
 '1958 Chevy Corvette Limited Edition',
 '1958 Setra Bus',
 '1960 BSA Gold Star DBD34',
 '1960 BSA Gold Star DBD34',
 '1961 Chevrolet Impala',
 '1961 Chevrolet Impala',
 '1961 Chevrolet Impala',
 '1961 Chevrolet Impala',
 '1962 City of Detroit Streetcar',
 '1962 City of Detroit Streetcar',
 '1962 City of Detroit Streetcar',
 '1962 LanciaA Delta 16V',
 '1962 LanciaA Delta 16V',
 '1962 Volkswagen Microbus',
 '1962 Volkswagen Microbus',
 '1964 Mercedes Tour Bus',
 '1965 Aston Martin DB5',
 '1965 Aston Martin DB5',
 '1966 Shelby Cobra 427 S/C',
 '1966 Shelby Cobra 427 S/C',
 '1968 Dodge Charger',
 '1968 Ford Mustang',
 '1968 Ford Mustang',
 '1969 Chevrolet Camaro Z28',
 '1969 Corvair Monza',
 '1969 Corvair Monza',
 '1969 Dodge Charger',
 '1969 Dodge Super Bee',
 '1969 Dodge Super Bee',
 '1969 Dodge Super Bee',
 '1969 Ford Falcon',
 '1969 Ford Falcon',
 '1969 Ford Falcon',
 '1969 Harley Davidson Ultimate Chopper',
 '1969 Harley Davidson Ultimate Chopper',
 '1969 Harley Davidson Ultimate Chopper',
 '1970 Chevy Chevelle SS 454',
 '1970 Dodge Coronet',
 '1970 Plymouth Hemi Cuda',
 '1970 Plymouth Hemi Cuda',
 '1971 Alpine Renault 1600s',
 '1971 Alpine Renault 1600s',
 '1972 Alfa Romeo GTA',
 '1972 Alfa Romeo GTA',
 '1974 Ducati 350 Mk3 Desmo',
 '1974 Ducati 350 Mk3 Desmo',
 '1974 Ducati 350 Mk3 Desmo',
 '1976 Ford Gran Torino',
 '1976 Ford Gran Torino',
 '1976 Ford Gran Torino',
 '1980s Black Hawk Helicopter',
 '1980’s GM Manhattan Express',
 '1980’s GM Manhattan Express',
 '1982 Camaro Z28',
 '1982 Camaro Z28',
 '1982 Camaro Z28',
 '1982 Ducati 900 Monster',
 '1982 Ducati 900 Monster',
 '1982 Ducati 900 Monster',
 '1982 Ducati 996 R',
 '1982 Ducati 996 R',
 '1982 Ducati 996 R',
 '1982 Ducati 996 R',
 '1982 Ducati 996 R',
 '1982 Lamborghini Diablo',
 '1992 Ferrari 360 Spider red',
 '1992 Ferrari 360 Spider red',
 '1992 Porsche Cayenne Turbo Silver',
 '1992 Porsche Cayenne Turbo Silver',
 '1993 Mazda RX-7',
 '1993 Mazda RX-7',
 '1995 Honda Civic',
 '1995 Honda Civic',
 '1996 Moto Guzzi 1100i',
 '1996 Moto Guzzi 1100i',
 '1996 Peterbilt 379 Stake Bed with Outrigger',
 '1997 BMW R 1100 S',
 '1997 BMW R 1100 S',
 '1998 Chrysler Plymouth Prowler',
 '1999 Indy 500 Monte Carlo SS',
 '1999 Indy 500 Monte Carlo SS',
 '1999 Yamaha Speed Boat',
 '2001 Ferrari Enzo',
 '2001 Ferrari Enzo',
 '2001 Ferrari Enzo',
 '2001 Ferrari Enzo',
 '2002 Suzuki XREO',
 '2002 Suzuki XREO',
 '2002 Suzuki XREO',
 '2002 Yamaha YZR M1',
 '2002 Yamaha YZR M1',
 '2002 Yamaha YZR M1',
 '2002 Yamaha YZR M1',
 '2003 Harley-Davidson Eagle Drag Bike',
 'ATA: B757-300',
 'America West Airlines B757-200',
 'American Airlines: B767-300',
 'American Airlines: MD-11S',
 'Boeing X-32A JSF',
 'Collectable Wooden Train',
 'Collectable Wooden Train',
 'Corsair F4U ( Bird Cage)',
 'Diamond T620 Semi-Skirted Tanker',
 'Diamond T620 Semi-Skirted Tanker',
 'Diamond T620 Semi-Skirted Tanker',
 'F/A 18 Hornet 1/72',
 'HMS Bounty',
 'P-51-D Mustang',
 'Pont Yacht',
 'The Mayflower',
 'The Queen Mary',
 'The Schooner Bluenose',
 'The Titanic',
 'The USS Constitution Ship']

## Level Up 2: Display the number of products each employee has sold

Alphabetize the results by employee last name.

Hint: Use the `quantityOrdered` column from `orderDetails`. Also, think about how to group the data when some employees might have the same first or last name.

In [152]:
pd.read_sql("""
    SELECT e.firstName,
           e.lastName,
           SUM(o.quantityOrdered) AS num_sold
    FROM employees AS e
    LEFT JOIN customers AS c
        ON e.employeeNumber = c.salesRepEmployeeNumber
    LEFT JOIN orders AS o2
        USING(customerNumber)
    LEFT JOIN orderDetails AS o
        USING(orderNumber)
    LEFT JOIN products AS p
        USING(productCode)
    GROUP BY e.employeeNumber
    ORDER BY e.lastName, e.firstName;
  """,conn)

   firstName   lastName  num_sold
0     Gerard     Bondur       NaN
1       Loui     Bondur    6186.0
2      Larry       Bott    8205.0
3    Anthony        Bow       NaN
4     Pamela   Castillo    9290.0
5       Jeff   Firrelli       NaN
6      Julie   Firrelli    4227.0
7       Andy     Fixter    6246.0
8     Martin     Gerard    4180.0
9     Gerard  Hernandez   14231.0
10    Leslie   Jennings   11854.0
11     Barry      Jones    7486.0
12   Yoshimi       Kato       NaN
13       Tom       King       NaN
14     Peter      Marsh    6632.0
15     Diane     Murphy       NaN
16      Mami      Nishi    4923.0
17      Mary  Patterson       NaN
18     Steve  Patterson    5561.0
19   William  Patterson       NaN
20    Leslie   Thompson    4056.0
21  Foon Yue      Tseng    5016.0
22    George     Vanauf    7423.0

## Level Up 3: Display the names employees who have sold more than 200 different products

Hint: this is different from the previous question because the quantity sold doesn't matter, only the number of different products

In [159]:
pd.read_sql("""
    SELECT e.firstName,
           e.lastName
    FROM employees AS e
    LEFT JOIN customers AS c
        ON e.employeeNumber = c.salesRepEmployeeNumber
    LEFT JOIN orders AS o2
        USING(customerNumber)
    LEFT JOIN orderDetails AS o
        USING(orderNumber)
    LEFT JOIN products AS p
        USING(productCode)
    GROUP BY e.employeeNumber
    HAVING COUNT(*) >200
    ORDER BY e.lastName, e.firstName;
  """,conn)

  firstName   lastName
0     Larry       Bott
1    Pamela   Castillo
2    Gerard  Hernandez
3    Leslie   Jennings
4     Barry      Jones
5    George     Vanauf

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!